import { Box, Container, Stack, Typography } from "@mui/material";
import * as React from "react";

export default () => (
  <Container style={{ marginBottom: 100 }}>
    <Stack spacing={5}>
      <Typography variant="h1">sinhala version</Typography>

      <Box>
        ලෝරීම් ඉප්සම් යනු සරලව මුද්‍රණ හා අකුරු ඇමිනුම් කර්මාන්තයේ උදාහරණ අකුරු පෙළ වෙයි. 1500 ගණන්වල සිට මේ දක්වා ලෝරම් ඉප්සම් කර්මාන්තයේ සම්මත අකුරු පෙළ ලෙස භාවිතා වන්නට පටන් ගත්තේ නාඳුනන මුද්රණ ශිල්පියෙකු යම් අකපුරු මිශ්‍රණයක් රැගෙන ඒවායෙන් අකුරු ආදර්ශ පොතක් සෑදීමට ගත් පසුවය . එය ශතවර්ශ පහක් පමණ නොවී පැමිණ ඉලෙක්ට්‍රොනික යුගයටද පිවිසුණි . 1960 දී ලෝරම් ඉප්සම් කොටස් අඩංගු ලෙට්‍රාසෙට් තහඩු නිදහස් කිරීමත් සමඟ ජනප්‍රිය වන්නට පටන් ගෙන මෑතකදී පේජ් මේකර් වැනි මෘදුකාංග සමඟ ද පැමිණීම නිසා ලෝක ප්‍රසිද්ධියට පත්විය.
      </Box>

      <Box>
        වේදනාවම ආදරයයි, ප්රධාන ගබඩා පද්ධතියයි. හැම වෙලාවකම නෙවෙයි හිනාවෙන් සරසා ගන්න ආසයි. පාකිස්ථානයේ පිරිසිදු වීමට නම්, සති අන්තය දුන්නෙන් ආදරය කළ යුතු අතර, නිවාස තෝරා ගැනීම ඉහළ නැංවීමට. පිවිතුරු වේදනාවක් නැත, ජීවන කිවිසුම් සඳහා වැලපීමේ යහනක් නැත. දුකට පෙර ජීවිතයේ පෙට්ටිය එකකින් අවසන් වේ. Phasellus vulputate eleifend semper. නමුත් එය ප්රධාන තට්ටුවට වඩා වැදගත් වේ. තුළ හෝ සිරස් ස්කන්ධය. දුන්නෙහි පෙට්ටිය තුළ, නමුත් ප්රතිශක්තිකරණ පද්ධතිය, ඔලිම්පික් ඕර්ක්ස් හි හකු. මහා නිදන්ගත වේදනාවක් නැත, එබැවින් එය මෘදු වේදනාවක් පමණි. නමුත් නිදහස් තට්ටුවක් නොතිබූ අතර විශාලතම එක විය. වෛරය හැර අන් කිසිවක් වෙනස් නොවේ. හෙට වැවෙන් පහසු නැත, සහ වැවේ හකු. සෑම වත්කමක්ම වලසුන් නොමැති වීමෙන් තෝරා ගනු ලැබේ, එය යුරෝපා සංගම් මතකයන් සඳහා මහත් දුකකි. වලසුන් නැති අතර පාඨමාලාව කැතයි. සැහැල්ලුවෙන් ජීවත් වෙන්න, දියුණු වෙන්න බොන්න පටන් ගන්න, ළිඳ පටන් ගන්න වැවක් නෑ නිඛිල හිඳින උර්නා සහ ෆ්‍රිංගිලා උර්නා යන වචන වලින් සමන්විත වේ.
      </Box>

      <Box>
        හැබැයි ලොකුම කැසිනෝ සවාරිය. නමුත් බළලාගේ වෛරය ප්‍රශ්නවලට ඇති බියේ ප්‍රතිඵලයකි. කුරබිටුර් රොන්කස් මැග්නා ක්වාම්. ඇත්ත වශයෙන්ම ඔහුට විටෙක ආදේශක සාමාජිකයන් අවශ්‍ය නොවේ. ඊතලය තෝරා ගන්නා ලදී. Proin life layer pure, එසේ නොවේ නම් එය පහසු වේ. සෙන් වලට වෛර කරන බළලාගේ රෝගය සහ අලංකාරය. නමුත් කැමරාවේ ස්කන්ධය, හුදෙක් ඊතලවල කාර්යබහුල වීම, සෑම විටම නිදන්ගත වේදනාවකි. ලොව පුරා පරාසය අලංකාර කිරීමට යුරෝපා සංගමයේ සෙන් වන නිදහස් මිනිසාගේ බිය.
      </Box>
    </Stack>
  </Container>
);
